# -*- coding: utf-8 -*-

# Вывести на консоль жителей комнат (модули room_1 и room_2)
# Формат: В комнате room_1 живут: ...

import room_1

print('В комнате room_1 живут:')
print(room_1.folks[0], 'и', room_1.folks[1])


