# -*- coding: utf-8 -*-

# Создать модуль my_burger. В нем определить функции добавления инградиентов:
#  - булочки
#  - котлеты
#  - огурчика
#  - помидорчика
#  - майонеза
#  - сыра
# В каждой функции выводить на консоль что-то вроде "А теперь добавим ..."

# В этом модуле создать рецепт двойного чизбургера (https://goo.gl/zA3goZ)
# с помощью фукций из my_burger и вывести на консоль.

# Создать рецепт своего бургера, по вашему вкусу.
# Если не хватает инградиентов - создать соответствующие функции в модуле my_burger

def bulki():
    print('А теперь добавим булки')

def kotleta():
    print("Жарим котлеты")

def ogurec():
    print('А теперь добавим огурец')

def tomato():
    print('А теперь добавим помидорчик')

def maionez():
    print('А теперь добавим майонез')

def cheez():
    print('А теперь добавим сыр')